app/views/items/new.html.erb

    <%= form.label :category_id %>
    <%= form.collection_select :category_id, Category.all, :id, :name %>
---
SELECT "categories".* FROM "categories"

    <%= form.label :supplier_id %>
    <%= form.collection_select :supplier_id, Supplier.all, :id, :name %>
---
SELECT "suppliers".* FROM "suppliers"