app/controllers/items_controller.rb

INSERT INTO "items" ("name", "quantity", "created_at", "updated_at", "category_id", "supplier_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Gauze"], ["quantity", 1000], ["created_at", "2024-02-03 09:50:14.580164"], ["updated_at", "2024-02-03 09:50:14.580164"], ["category_id", 1], ["supplier_id", 1]]
---
    def create
      @item = Item.new(item_params)

      if @item.save