app/controllers/suppliers_controller.rb

INSERT INTO "suppliers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Henry Schein"], ["created_at", "2024-02-03 09:49:48.632493"], ["updated_at", "2024-02-03 09:49:48.632493"]]
---
    def create
      @supplier = Supplier.new(supplier_params)

      if @supplier.save

UPDATE "suppliers" SET "updated_at" = $1, "phone_number" = $2, "email" = $3 WHERE "suppliers"."id" = $4  [["updated_at", "2024-02-03 12:01:24.272791"], ["phone_number", "07823456543"], ["email", "test@test.test"], ["id", 1]]
---
    def update
      if @supplier.update(supplier_params)

SELECT "suppliers".* FROM "suppliers" WHERE "suppliers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_supplier
      @supplier = Supplier.find(params[:id])